#5.Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
#*Пример:*
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# xA = int(input('Введите координаты точки А по оси x: '))
# yA = int(input('Введите координаты точки А по оси y: '))
# xB = int(input('Введите координаты точки B по оси x: '))
# yB = int(input('Введите координаты точки B по оси y: '))
# AB_distance = ((xB-xA)**2 + (yB-yA)**2)**0.5
# print('{:.2f}'.format(AB_distance))